In [1]:
import pandas as pd
import numpy as np
import sqlite3 as sql

In [2]:
file = "sqlite_db_pythonsqlite.db"
db = sql.connect(file)

In [3]:
queryf = "SELECT * FROM Facilities"
querym = "SELECT * FROM Members"
queryb = "SELECT * FROM Bookings"

In [4]:
facilities = pd.read_sql_query(queryf, db)
members = pd.read_sql_query(querym, db)
bookings = pd.read_sql_query(queryb, db)

In [5]:
facilities.head()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

In [6]:
members.head()

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

In [7]:
bookings.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [8]:
bookings['starttime'] = pd.to_datetime(bookings['starttime'])

In [9]:
bookings['booking_month'] = pd.DatetimeIndex(bookings['starttime']).month

In [10]:
bookingsXmembers = pd.merge(bookings, members, on='memid', how='left')

In [11]:
ccfull = pd.merge(bookingsXmembers, facilities, on='facid', how='left')

In [12]:
ccfull.head()

,bookid,facid,memid,starttime,slots,booking_month,surname,firstname,address,zipcode,telephone,recommendedby,joindate,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,3,1,2012-07-03 11:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Table Tennis,0.0,5.0,320,10
1,1,4,1,2012-07-03 08:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Massage Room 1,9.9,80.0,4000,3000
2,2,6,0,2012-07-03 18:00:00,2,7,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00,Squash Court,3.5,17.5,5000,80
3,3,7,1,2012-07-03 19:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Snooker Table,0.0,5.0,450,15
4,4,8,1,2012-07-03 10:00:00,1,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Pool Table,0.0,5.0,400,15

In [13]:
def f(row):
        if row['memid'] != 0:
            value = row['slots'] * row['membercost']
        elif row['memid'] == 0:
            value = row['slots'] * row['guestcost']
        else:
            value = 0
        return value

In [14]:
ccfull['cost'] = ccfull.apply(f, axis = 1)

In [15]:
ccfull.head()

,bookid,facid,memid,starttime,slots,booking_month,surname,firstname,address,zipcode,telephone,recommendedby,joindate,name,membercost,guestcost,initialoutlay,monthlymaintenance,cost
0,0,3,1,2012-07-03 11:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Table Tennis,0.0,5.0,320,10,0.0
1,1,4,1,2012-07-03 08:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Massage Room 1,9.9,80.0,4000,3000,19.8
2,2,6,0,2012-07-03 18:00:00,2,7,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00,Squash Court,3.5,17.5,5000,80,35.0
3,3,7,1,2012-07-03 19:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Snooker Table,0.0,5.0,450,15,0.0
4,4,8,1,2012-07-03 10:00:00,1,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Pool Table,0.0,5.0,400,15,0.0

In [16]:
q10 = ccfull.groupby('name')['cost'].sum()

In [17]:
q10 = pd.DataFrame(q10)

In [18]:
q10 = q10[q10['cost'] < 1000]

In [19]:
q10['cost'].sort_values(ascending=False)

name
Pool Table       270.0
Snooker Table    240.0
Table Tennis     180.0
Name: cost, dtype: float64

In [20]:
# Answer to Q10

q10

                cost
name
Pool Table     270.0
Snooker Table  240.0
Table Tennis   180.0

In [21]:
members['lastfirst'] = members['surname'] + ' ' + members['firstname']

In [22]:
id_name = dict(zip(members['memid'],members['lastfirst']))

In [23]:
q11 = members

In [24]:
q11['recommendedby'] = pd.to_numeric(q11['recommendedby'],errors='ignore')

In [25]:
q11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   memid          31 non-null     int64
 1   surname        31 non-null     object
 2   firstname      31 non-null     object
 3   address        31 non-null     object
 4   zipcode        31 non-null     int64
 5   telephone      31 non-null     object
 6   recommendedby  22 non-null     float64
 7   joindate       31 non-null     object
 8   lastfirst      31 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 2.3+ KB

In [26]:
q11['recommended_name'] = q11['recommendedby'].map(id_name)

In [27]:
q11

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate,lastfirst,recommended_name
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,NaN,2012-07-01 00:00:00,GUEST GUEST,NaN
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,NaN,2012-07-02 12:02:05,Smith Darren,NaN
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,NaN,2012-07-02 12:08:23,Smith Tracy,NaN
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,NaN,2012-07-03 09:32:15,Rownam Tim,NaN
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1.0,2012-07-03 10:25:05,Joplette Janice,Smith Darren
5,5,Butters,Gerald,"1065 Huntingdon Avenue, Boston",56754,(844) 078-4130,1.0,2012-07-09 10:44:09,Butters Gerald,Smith Darren
6,6,Tracy,Burton,"3 Tunisia Drive, Boston",45678,(822) 354-9973,NaN,2012-07-15 08:52:55,Tracy Burton,NaN
7,7,Dare,Nancy,"6 Hunting Lodge Way, Boston",10383,(833) 776-4001,4.0,2012-07-25 08:59:12,Dare Nancy,Joplette Janice
8,8,Boothe,Tim,"3 Bloomsbury Close, Reading, 00234",234,(811) 433-2547,3.0,2012-07-25 16:02:35,Boothe Tim,Rownam Tim
9,9,Stibbons,Ponder,"5 Dragons Way, Winchester",87630,(833) 160-3900,6.0,2012-07-25 17:09:05,Stibbons Ponder,Tracy Burton
10,10,Owen,Charles,"52 Cheshire Grove, Winchester, 28563",28563,(855) 542-5251,1.0,2012-08-03 19:42:37,Owen Charles,Smith Darren
11,11,Jones,David,"976 Gnats Close, Reading",33862,(844) 536-8036,4.0,2012-08-06 16:32:55,Jones David,Joplette Janice
12,12,Baker,Anne,"55 Powdery Street, Boston",80743,844-076-5141,9.0,2012-08-10 14:23:22,Baker Anne,Stibbons Ponder
13,13,Farrell,Jemima,"103 Firth Avenue, North Reading",57392,(855) 016-0163,NaN,2012-08-10 14:28:01,Farrell Jemima,NaN
14,14,Smith,Jack,"252 Binkington Way, Boston",69302,(822) 163-3254,1.0,2012-08-10 16:22:05,Smith Jack,Smith Darren
15,15,Bader,Florence,"264 Ursula Drive, Westford",84923,(833) 499-3527,9.0,2012-08-10 17:52:03,Bader Florence,Stibbons Ponder
16,16,Baker,Timothy,"329 James Street, Reading",58393,833-941-0824,13.0,2012-08-15 10:34:25,Baker Timothy,Farrell Jemima
17,17,Pinker,David,"5 Impreza Road, Boston",65332,811 409-6734,13.0,2012-08-16 11:32:47,Pinker David,Farrell Jemima
18,20,Genting,Matthew,"4 Nunnington Place, Wingfield, Boston",52365,(811) 972-1377,5.0,2012-08-19 14:55:55,Genting Matthew,Butters Gerald
19,21,Mackenzie,Anna,"64 Perkington Lane, Reading",64577,(822) 661-2898,1.0,2012-08-26 09:32:05,Mackenzie Anna,Smith Darren
20,22,Coplin,Joan,"85 Bard Street, Bloomington, Boston",43533,(822) 499-2232,16.0,2012-08-29 08:32:41,Coplin Joan,Baker Timothy
21,24,Sarwin,Ramnaresh,"12 Bullington Lane, Boston",65464,(822) 413-1470,15.0,2012-09-01 08:44:42,Sarwin Ramnaresh,Bader Florence
22,26,Jones,Douglas,"976 Gnats Close, Reading",11986,844 536-8036,11.0,2012-09-02 18:43:05,Jones Douglas,Jones David
23,27,Rumney,Henrietta,"3 Burkington Plaza, Boston",78533,(822) 989-8876,20.0,2012-09-05 08:42:35,Rumney Henrietta,Genting Matthew
24,28,Farrell,David,"437 Granite Farm Road, Westford",43532,(855) 755-9876,NaN,2012-09-15 08:22:05,Farrell David,NaN
25,29,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2.0,2012-09-17 12:27:15,Worthington-Smyth Henry,Smith Tracy
26,30,Purview,Millicent,"641 Drudgery Close, Burnington, Boston",34232,(855) 941-9786,2.0,2012-09-18 19:04:01,Purview Millicent,Smith Tracy
27,33,Tupperware,Hyacinth,"33 Cheerful Plaza, Drake Road, Westford",68666,(822) 665-5327,NaN,2012-09-18 19:32:05,Tupperware Hyacinth,NaN
28,35,Hunt,John,"5 Bullington Lane, Boston",54333,(899) 720-6978,30.0,2012-09-19 11:32:45,Hunt John,Purview Millicent
29,36,Crumpet,Erica,"Crimson Road, North Reading",75655,(811) 732-4816,2.0,2012-09-22 08:36:38,Crumpet Erica,Smith Tracy
30,37,Smith,Darren,"3 Funktown, Denzington, Boston",66796,(822) 577-3541,NaN,2012-09-26 18:08:45,Smith Darren,NaN

In [28]:
q11 = q11[['memid','surname','firstname','recommended_name']]

In [29]:
q11 = q11.sort_values(by='surname')

In [30]:
q11 = q11.fillna(value='No recommendation given')

In [31]:
# Answer to Q11

q11

    memid            surname  firstname         recommended_name
15     15              Bader   Florence          Stibbons Ponder
16     16              Baker    Timothy           Farrell Jemima
12     12              Baker       Anne          Stibbons Ponder
8       8             Boothe        Tim               Rownam Tim
5       5            Butters     Gerald             Smith Darren
20     22             Coplin       Joan            Baker Timothy
29     36            Crumpet      Erica              Smith Tracy
7       7               Dare      Nancy          Joplette Janice
24     28            Farrell      David  No recommendation given
13     13            Farrell     Jemima  No recommendation given
0       0              GUEST      GUEST  No recommendation given
18     20            Genting    Matthew           Butters Gerald
28     35               Hunt       John        Purview Millicent
11     11              Jones      David          Joplette Janice
22     26              Jones    Douglas              Jones David
4       4           Joplette     Janice             Smith Darren
19     21          Mackenzie       Anna             Smith Darren
10     10               Owen    Charles             Smith Darren
17     17             Pinker      David           Farrell Jemima
26     30            Purview  Millicent              Smith Tracy
3       3             Rownam        Tim  No recommendation given
23     27             Rumney  Henrietta          Genting Matthew
21     24             Sarwin  Ramnaresh           Bader Florence
1       1              Smith     Darren  No recommendation given
2       2              Smith      Tracy  No recommendation given
14     14              Smith       Jack             Smith Darren
30     37              Smith     Darren  No recommendation given
9       9           Stibbons     Ponder             Tracy Burton
6       6              Tracy     Burton  No recommendation given
27     33         Tupperware   Hyacinth  No recommendation given
25     29  Worthington-Smyth      Henry              Smith Tracy

In [32]:
q12_q13 = ccfull

In [33]:
q12_q13 = q12_q13[q12_q13.memid != 0]

In [34]:
q12_q13

,bookid,facid,memid,starttime,slots,booking_month,surname,firstname,address,zipcode,telephone,recommendedby,joindate,name,membercost,guestcost,initialoutlay,monthlymaintenance,cost
0,0,3,1,2012-07-03 11:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Table Tennis,0.0,5.0,320,10,0.0
1,1,4,1,2012-07-03 08:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Massage Room 1,9.9,80.0,4000,3000,19.8
3,3,7,1,2012-07-03 19:00:00,2,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Snooker Table,0.0,5.0,450,15,0.0
4,4,8,1,2012-07-03 10:00:00,1,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Pool Table,0.0,5.0,400,15,0.0
5,5,8,1,2012-07-03 15:00:00,1,7,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05,Pool Table,0.0,5.0,400,15,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4038,4038,8,29,2012-09-30 16:30:00,2,9,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2,2012-09-17 12:27:15,Pool Table,0.0,5.0,400,15,0.0
4039,4039,8,29,2012-09-30 18:00:00,1,9,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2,2012-09-17 12:27:15,Pool Table,0.0,5.0,400,15,0.0
4040,4040,8,21,2012-09-30 18:30:00,1,9,Mackenzie,Anna,"64 Perkington Lane, Reading",64577,(822) 661-2898,1,2012-08-26 09:32:05,Pool Table,0.0,5.0,400,15,0.0
4041,4041,8,16,2012-09-30 19:00:00,1,9,Baker,Timothy,"329 James Street, Reading",58393,833-941-0824,13,2012-08-15 10:34:25,Pool Table,0.0,5.0,400,15,0.0
4042,4042,8,29,2012-09-30 19:30:00,1,9,Worthington-Smyth,Henry,"55 Jagbi Way, North Reading",97676,(855) 894-3758,2,2012-09-17 12:27:15,Pool Table,0.0,5.0,400,15,0.0

In [35]:
q12 = q12_q13.pivot_table(values='slots',index='memid',columns='name',aggfunc='sum')

In [36]:
q12 = q12.fillna(0)

In [37]:
q12['Member'] = q11['memid'].map(id_name)

In [38]:
q12cols = q12.columns.tolist()

In [39]:
q12cols = q12cols[-1:] + q12cols[:-1]

In [40]:
q12 = q12[q12cols]

In [41]:
# Answer to Q12, number of slots booked per Member

q12

name,Member,Badminton Court,Massage Room 1,Massage Room 2,Pool Table,Snooker Table,Squash Court,Table Tennis,Tennis Court 1,Tennis Court 2
memid,,,,,,,,,,
1,Smith Darren,432.0,58.0,0.0,28.0,24.0,30.0,56.0,0.0,57.0
2,Smith Tracy,102.0,12.0,0.0,64.0,90.0,12.0,56.0,93.0,6.0
3,Rownam Tim,12.0,176.0,4.0,282.0,0.0,0.0,150.0,18.0,18.0
4,Joplette Janice,0.0,24.0,4.0,27.0,142.0,30.0,18.0,57.0,24.0
5,Butters Gerald,63.0,66.0,2.0,6.0,72.0,18.0,2.0,171.0,9.0
6,Tracy Burton,6.0,62.0,0.0,30.0,40.0,78.0,48.0,93.0,9.0
7,Dare Nancy,30.0,38.0,10.0,19.0,46.0,0.0,10.0,81.0,33.0
8,Boothe Tim,36.0,76.0,0.0,26.0,90.0,24.0,8.0,12.0,168.0
9,Stibbons Ponder,48.0,40.0,0.0,12.0,40.0,4.0,6.0,3.0,96.0
10,Owen Charles,18.0,22.0,4.0,1.0,44.0,14.0,50.0,51.0,141.0
11,Jones David,24.0,40.0,8.0,8.0,4.0,16.0,22.0,84.0,99.0
12,Baker Anne,30.0,6.0,4.0,12.0,0.0,110.0,2.0,18.0,114.0
13,Farrell Jemima,21.0,68.0,0.0,1.0,44.0,16.0,24.0,3.0,3.0
14,Smith Jack,36.0,54.0,2.0,7.0,10.0,22.0,10.0,75.0,3.0
15,Bader Florence,27.0,0.0,4.0,23.0,66.0,4.0,86.0,3.0,24.0
16,Baker Timothy,21.0,50.0,0.0,95.0,0.0,10.0,48.0,45.0,21.0
17,Pinker David,21.0,6.0,0.0,9.0,32.0,6.0,34.0,51.0,0.0
20,Coplin Joan,0.0,52.0,2.0,18.0,2.0,0.0,54.0,3.0,0.0
21,Sarwin Ramnaresh,96.0,2.0,0.0,83.0,14.0,4.0,32.0,0.0,0.0
22,Jones Douglas,0.0,2.0,4.0,11.0,20.0,2.0,46.0,21.0,0.0
24,Farrell David,21.0,16.0,6.0,13.0,36.0,4.0,6.0,15.0,36.0
26,Purview Millicent,6.0,0.0,0.0,2.0,0.0,2.0,0.0,27.0,0.0
27,Tupperware Hyacinth,0.0,0.0,0.0,3.0,28.0,4.0,0.0,0.0,3.0
28,Hunt John,0.0,0.0,0.0,25.0,2.0,2.0,0.0,18.0,3.0
29,Crumpet Erica,15.0,2.0,0.0,37.0,0.0,0.0,6.0,0.0,0.0
30,Smith Darren,6.0,0.0,0.0,5.0,2.0,2.0,14.0,0.0,3.0
33,NaN,3.0,2.0,0.0,9.0,12.0,2.0,0.0,0.0,0.0
35,NaN,6.0,6.0,0.0,0.0,0.0,2.0,2.0,12.0,12.0
36,NaN,6.0,4.0,0.0,0.0,0.0,0.0,4.0,3.0,0.0

In [44]:
q13 = q12_q13.pivot_table(values='slots',index='booking_month',columns='name',aggfunc='sum')

In [45]:
# Answer to Q13, slots booked per month per facility

q13

name,Badminton Court,Massage Room 1,Massage Room 2,Pool Table,Snooker Table,Squash Court,Table Tennis,Tennis Court 1,Tennis Court 2
booking_month,,,,,,,,,
7,165,166,8,110,140,50,98,201,123
8,414,316,18,303,316,184,296,339,345
9,507,402,28,443,404,184,400,417,414